driver-tests/bpelse/assign/AssignJbi/test/decimaladdInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><SOAP-ENV:Body><item xmlns="http://stc.com/Operation"><byte0>1</byte0><byte1>1</byte1><decimal0>3.1415926535897932384626433832795</decimal0><decimal1>3.1415926535897932384626433832795</decimal1><Int0>0</Int0><Int1>0</Int1><Integer0>0</Integer0><Integer1>0</Integer1><Long0>2147483647</Long0><Long1>2147483647</Long1><String0>String</String0><String1>String</String1><Short0>4096</Short0><Short1>4096</Short1><Boolean0>true</Boolean0><Boolean1>true</Boolean1><retByte>127</retByte><retDecimal>3.1415926535897932384626433832795</retDecimal><retInt>0</retInt><retInteger>0</retInteger><retLong>2147483647</retLong><retString>String</retString><retShort>4096</retShort><retBoolean>true</retBoolean></item></SOAP-ENV:Body></SOAP-ENV:Envelope>