driver-tests/bpelse/assign/AssignJbi/test/results/intsubInvoke/Actual_20130314144943_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/Operation" xmlns:msgns="http://stc.com/Operation">
      <retInt>24</retInt>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>